index.org
#+TITLE: scroll-utility
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="index.css" />
#+INFOJS_OPT: path:org-info.js view:info
#+STARTUP: content
#+OPTIONS: num:nil

* Features
- Extremely powerful for scrolling to anywhere in the page, like centering
  elements to certain degree.
- Custom easing animations for scrolling
- Detect onScroll events and differentiate between user and utility scroll
- High performance
- Dependency free
- Small footprint 9.32KiB
- Typescript friendly
- Handle multiple scroll animation at the same time

* Installation
From npm:
#+BEGIN_SRC bash
$ npm install --save scroll-utility
#+END_SRC

From a cdn: [[https://www.jsdelivr.com/package/npm/scroll-utility][jsdelivr]]
#+BEGIN_SRC html
<script src="https://cdn.jsdelivr.net/npm/scroll-utility@5"></script>
#+END_SRC
when downloading from a cdn the package will be globally exported as _ScrollUtility_

* *Scroll*
The *Scroll* class is the one used to scroll
#+BEGIN_SRC typescript
import { Scroll } from "scroll-utility"
// const Scroll = ScrollUtility.Scroll // from cdn

const scrollManager = new Scroll()
scrollManager.scroll("#some-element").offset(-50)
#+END_SRC
** constructor
The *Scroll* constructor accepts several options:
#+BEGIN_SRC typescript
import Scroll from "scroll-utility";

new Scroll({
    element?,
    horizontal?,
    duration?,
    easing?,
    onScroll?,
}) // or
new Scroll(element?, horizontal?, duration?, easing?, onScroll?)
#+END_SRC

Quick overview of each parameter:
|------------+-----------------+------------------------------------+--------------------------------------------------------------------------|
| parameter  | default value   | type                               | notes                                                                    |
|------------+-----------------+------------------------------------+--------------------------------------------------------------------------|
| element    | window          | string; Window; Element            | element where the scroll will take place, a string means a querySelector |
| horizontal | false           | boolean                            | direction of the scroll animation                                        |
| duration   | 1000            | number                             | default duration of scroll animations, in miliseconds                    |
| easing     | "easeInOutQuad" | string; (t, b, c, d) => number     | easing function used for scroll animations                               |
| onScroll   | null            | null; (external?: boolean) => void | callback function onscroll                                               |

For example, to create a horizontal *scrollManager* within "#container", with a
duration of *500ms* for its '*linear*' scroll animation, that logs *"hi"* every time
it scrolls:

#+BEGIN_SRC typescript
new Scroll({
    element: "#container",
    horizontal: true,
    duration: 500,
    easing: "linear",
    onScroll: () => console.log("hi"),
})
#+END_SRC
It's also posible to pass parameters without an object
#+BEGIN_SRC typescript
new Scroll(
    "#container",
    true,
    500,
    "linear",
    () => console.log("hi")
)
#+END_SRC

*** element
#+BEGIN_SRC typescript
new Scroll({ element: "#container" })
#+END_SRC
The *element* option when creating a 'scrollManager' indicates the element in which the scroll will take place.
By default it will scroll normally in the page, as in *window* or in *document.documentElement*

It can be the result of *document.getElementById* or *document.querySelector*.

If it's a *string*, then it will use it as a *querySelector* with
*document.querySelector* for getting an *Element*.

You can call *document.querySelector* beforehand if you want to ensure
the element exists

*** horizontal
#+BEGIN_SRC typescript
new Scroll({ horizontal: true })
#+END_SRC
The *horizontal* option indicates the direction when scrolling, by default
*false*, wich means vertical scroll

