index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-21 Wed 05:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>scroll-utility</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Perez Alvarez" />
<link rel="stylesheet" type="text/css" href="index.css" />


</head>
<body>
<div id="content">
<h1 class="title">scroll-utility</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1daa24f">Features</a></li>
<li><a href="#org305eda9">Installation</a></li>
<li><a href="#orga144822"><b>Scroll</b></a>
<ul>
<li><a href="#org2e2f97d">constructor</a>
<ul>
<li><a href="#org5547fd8">element</a></li>
<li><a href="#org9fe9537">horizontal</a></li>
<li><a href="#org24be2c5">duration</a></li>
<li><a href="#org3e5d67c">easing</a></li>
<li><a href="#org43f563d">onScroll</a></li>
</ul>
</li>
<li><a href="#org568753a">scroll</a>
<ul>
<li><a href="#org769732f">to "position"</a></li>
<li><a href="#orgc311b07">to "element"</a></li>
</ul>
</li>
<li><a href="#org135fca9">offset</a></li>
<li><a href="#org8120b3c">other</a>
<ul>
<li><a href="#org40b031a">stopAllAnimations</a></li>
<li><a href="#org18004ec">size</a></li>
<li><a href="#orgaf5b18e">scrollSize</a></li>
<li><a href="#org2fd2480">scrollPosition</a></li>
<li><a href="#orgb3594a9">getRelativeElementPosition</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3ec3dd9"><b>Misc</b></a>
<ul>
<li><a href="#orgfe82371">getSize</a></li>
<li><a href="#org2566678">getSizeWithBorders</a></li>
<li><a href="#org53fb797">getScrollPosition</a></li>
<li><a href="#orgeae1cd9">getScrollSize</a></li>
<li><a href="#org782a2b0">getRelativeElementPosition</a></li>
<li><a href="#orgf903d82">getDistToCenterElement</a></li>
<li><a href="#orge43af03">scrollTo</a></li>
</ul>
</li>
<li><a href="#org6cb47e8">Browser Compatibility</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1daa24f" class="outline-2">
<h2 id="org1daa24f">Features</h2>
<div class="outline-text-2" id="text-org1daa24f">
<ul class="org-ul">
<li>Extremely powerful for scrolling to anywhere in the page, like centering
elements to certain degree.</li>
<li>Custom easing animations for scrolling</li>
<li>Detect onScroll events and differentiate between user and utility scroll</li>
<li>High performance</li>
<li>Dependency free</li>
<li>Small footprint 9.32KiB</li>
<li>Typescript friendly</li>
<li>Handle multiple scroll animation at the same time</li>
</ul>
</div>
</div>

<div id="outline-container-org305eda9" class="outline-2">
<h2 id="org305eda9">Installation</h2>
<div class="outline-text-2" id="text-org305eda9">
<p>
From npm:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ npm install --save scroll-utility
</pre>
</div>

<p>
From a cdn: <a href="https://www.jsdelivr.com/package/npm/scroll-utility">jsdelivr</a>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #bc6ec5; font-weight: bold;">script</span> <span style="color: #7590db;">src</span>=<span style="color: #2d9574;">"https://cdn.jsdelivr.net/npm/scroll-utility@5"</span>&gt;&lt;/<span style="color: #bc6ec5; font-weight: bold;">script</span>&gt;
</pre>
</div>
<p>
when downloading from a cdn the package will be globally exported as <span class="underline">ScrollUtility</span>
</p>
</div>
</div>

<div id="outline-container-orga144822" class="outline-2">
<h2 id="orga144822"><b>Scroll</b></h2>
<div class="outline-text-2" id="text-orga144822">
<p>
The <b>Scroll</b> class is the one used to scroll
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">{</span> Scroll <span style="color: #4f97d7;">}</span> <span style="color: #4f97d7; font-weight: bold;">from</span> <span style="color: #2d9574;">"scroll-utility"</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">const Scroll = ScrollUtility.Scroll // from cdn</span>

<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">()</span>
scrollManager.scroll<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"#some-element"</span><span style="color: #4f97d7;">)</span>.offset<span style="color: #4f97d7;">(</span>-<span style="color: #a45bad;">50</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org2e2f97d" class="outline-3">
<h3 id="org2e2f97d">constructor</h3>
<div class="outline-text-3" id="text-org2e2f97d">
<p>
The <b>Scroll</b> constructor accepts several options:
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">import</span> Scroll <span style="color: #4f97d7; font-weight: bold;">from</span> <span style="color: #2d9574;">"scroll-utility"</span>;

<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
    element?,
    horizontal?,
    duration?,
    easing?,
    onScroll?,
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">or</span>
<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span>element?, horizontal?, duration?, easing?, onScroll?<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Quick overview of each parameter:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">parameter</th>
<th scope="col" class="org-left">default value</th>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-left">notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">element</td>
<td class="org-left">window</td>
<td class="org-left">string; Window; Element</td>
<td class="org-left">element where the scroll will take place, a string means a querySelector</td>
</tr>

<tr>
<td class="org-left">horizontal</td>
<td class="org-left">false</td>
<td class="org-left">boolean</td>
<td class="org-left">direction of the scroll animation</td>
</tr>

<tr>
<td class="org-left">duration</td>
<td class="org-left">1000</td>
<td class="org-left">number</td>
<td class="org-left">default duration of scroll animations, in miliseconds</td>
</tr>

<tr>
<td class="org-left">easing</td>
<td class="org-left">"easeInOutQuad"</td>
<td class="org-left">string; (t, b, c, d) =&gt; number</td>
<td class="org-left">easing function used for scroll animations</td>
</tr>

<tr>
<td class="org-left">onScroll</td>
<td class="org-left">null</td>
<td class="org-left">null; (external?: boolean) =&gt; void</td>
<td class="org-left">callback function onscroll</td>
</tr>
</tbody>
</table>

<p>
For example, to create a horizontal <b>scrollManager</b> within "#container", with a
duration of <b>500ms</b> for its '<b>linear</b>' scroll animation, that logs <b>"hi"</b> every time
it scrolls:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
    element: <span style="color: #2d9574;">"#container"</span>,
    horizontal: <span style="color: #4f97d7; font-weight: bold;">true</span>,
    duration: <span style="color: #a45bad;">500</span>,
    easing: <span style="color: #2d9574;">"linear"</span>,
    onScroll: <span style="color: #2d9574;">()</span> =&gt; console.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"hi"</span><span style="color: #2d9574;">)</span>,
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
It's also posible to pass parameters without an object
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span>
    <span style="color: #2d9574;">"#container"</span>,
    <span style="color: #4f97d7; font-weight: bold;">true</span>,
    <span style="color: #a45bad;">500</span>,
    <span style="color: #2d9574;">"linear"</span>,
    <span style="color: #bc6ec5;">()</span> =&gt; console.log<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"hi"</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org5547fd8" class="outline-4">
<h4 id="org5547fd8">element</h4>
<div class="outline-text-4" id="text-org5547fd8">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> element: <span style="color: #2d9574;">"#container"</span> <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
The <b>element</b> option when creating a 'scrollManager' indicates the element in which the scroll will take place.
By default it will scroll normally in the page, as in <b>window</b> or in <b>document.documentElement</b>
</p>

<p>
It can be the result of <b>document.getElementById</b> or <b>document.querySelector</b>.
</p>

<p>
If it's a <b>string</b>, then it will use it as a <b>querySelector</b> with
<b>document.querySelector</b> for getting an <b>Element</b>.
</p>

<p>
You can call <b>document.querySelector</b> beforehand if you want to ensure
the element exists
</p>
</div>
</div>

<div id="outline-container-org9fe9537" class="outline-4">
<h4 id="org9fe9537">horizontal</h4>
<div class="outline-text-4" id="text-org9fe9537">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> horizontal: <span style="color: #4f97d7; font-weight: bold;">true</span> <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
The <b>horizontal</b> option indicates the direction when scrolling, by default
<b>false</b>, wich means vertical scroll
</p>
</div>
</div>
