index.org
*** duration
#+BEGIN_SRC typescript
new Scroll({ duration: 0 })
#+END_SRC
The *duration* option indicates the default duration of the scroll animations in milliseconds, by default _1000ms_
It will be used along with [[easing]] for creating the *smooth* animation when scrolling

If you want to disable the /smooth/ animation, set *duration* to 0.

It can be changed any time:
#+BEGIN_SRC typescript
const scrollManager = new Scroll({ duration: 0 })

scrollManager.duration = 999
#+END_SRC
*** easing
#+BEGIN_SRC typescript
new Scroll({ easing: "linear" })
#+END_SRC
The *easing* option indicates the default animation of the scroll, by default *"inOutQuad"*

Posible values are "linear" and some of the form: 'easeIn{*type*}' | "easeOut{*type*}" | "easeInOut{*type*}"; being *type*: "Quart",
"Cubic", "Bounce"...

You can also create your own easing function:
#+BEGIN_SRC typescript
  new Scroll({ easing: (t, b, c, d) => c / d + b })
#+END_SRC
Thats the function I use for "linear"

Learn more about easing functions [[https://easings.net/en][here]]

It can be changed any time:
#+BEGIN_SRC typescript
const scrollManager = new Scroll({ easing: "linear" })

scrollManager.easing = "easeOutBounce"
#+END_SRC
*** onScroll
#+BEGIN_SRC typescript
new Scroll({
  onScroll: (external) => {
    if (external) {
        console.log("external scroll")
    } else {
        console.log("internal scroll")
    }
  },
})
#+END_SRC

What does it mean?, well, *external* is an attempt
It can be changed any time:
#+BEGIN_SRC typescript
const scrollManager = new Scroll({ onScroll: null })

scrollManager.onScroll = () => alert("hi")

#+END_SRC
** scroll
#+BEGIN_SRC typescript
const scrollManager = new Scroll()

// toPosition
scrollManager.scroll({
    value,
    duration?,
    easing?
}) // or
scrollManager.scroll(value, duration?, easing?)

// toElement
scrollManager.scroll({
    element,
    value?,
    duration?,
    easing?
}) // or
scrollManager.scroll(element, value?, duration?, easing?)
#+END_SRC
*** to "position"
#+BEGIN_SRC typescript
const scrollManager = new Scroll()

scrollManager.scroll({
  value,
  duration?,
  easing?,
})
//or
scrollManager.scroll(value, duration?, easing?)
#+END_SRC

Calling *scroll* will do scroll to the position *value*: eg. *0* will do scroll
to the top of the page

*duration* is the duration of that scroll action. If not specified it will use the
one in [[duration][constructor]].

*easing* is the ease animation of that scroll action. If not specified it will use the
one in [[easing][constructor]].
*** to "element"
#+BEGIN_SRC typescript
const scrollManager = new Scroll()

scrollManager.scroll({
    element,
    value?,
    duration?,
    easing?,
})
//or
scrollManager.scroll(element, value?, duration?, easing?)
#+END_SRC

Calling *scroll* will do scroll to the position of the element *element*, and
will center it at *value*, 0 by default. ie. the element will be at the top of
the screen

*duration* is the duration of that scroll action. If not specified it will use the
one in [[duration][constructor]].

*easing* is the ease animation of that scroll action. If not specified it will use the
one in [[easing][constructor]].
** offset
#+BEGIN_SRC typescript
const scrollManager = new Scroll()

scrollManager.offset({
  value: 100,
  duration: 1000,
  easing: "some",
})
//or
scrollManager.offset(100, 1000, "some")
#+END_SRC
** other
