index.html

<div id="outline-container-org24be2c5" class="outline-4">
<h4 id="org24be2c5">duration</h4>
<div class="outline-text-4" id="text-org24be2c5">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> duration: <span style="color: #a45bad;">0</span> <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
The <b>duration</b> option indicates the default duration of the scroll animations in milliseconds, by default <span class="underline">1000ms</span>
It will be used along with <a href="#org3e5d67c">easing</a> for creating the <b>smooth</b> animation when scrolling
</p>

<p>
If you want to disable the <i>smooth</i> animation, set <b>duration</b> to 0.
</p>

<p>
It can be changed any time:
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> duration: <span style="color: #a45bad;">0</span> <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

scrollManager.duration = <span style="color: #a45bad;">999</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e5d67c" class="outline-4">
<h4 id="org3e5d67c">easing</h4>
<div class="outline-text-4" id="text-org3e5d67c">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> easing: <span style="color: #2d9574;">"linear"</span> <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
The <b>easing</b> option indicates the default animation of the scroll, by default <b>"inOutQuad"</b>
</p>

<p>
Posible values are "linear" and some of the form: 'easeIn{<b>type</b>}' | "easeOut{<b>type</b>}" | "easeInOut{<b>type</b>}"; being <b>type</b>: "Quart",
"Cubic", "Bounce"&#x2026;
</p>

<p>
You can also create your own easing function:
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> easing: <span style="color: #2d9574;">(</span>t, b, c, d<span style="color: #2d9574;">)</span> =&gt; c / d + b <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
Thats the function I use for "linear"
</p>

<p>
Learn more about easing functions <a href="https://easings.net/en">here</a>
</p>

<p>
It can be changed any time:
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> easing: <span style="color: #2d9574;">"linear"</span> <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

scrollManager.easing = <span style="color: #2d9574;">"easeOutBounce"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org43f563d" class="outline-4">
<h4 id="org43f563d">onScroll</h4>
<div class="outline-text-4" id="text-org43f563d">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
  onScroll: <span style="color: #2d9574;">(</span>external<span style="color: #2d9574;">)</span> =&gt; <span style="color: #2d9574;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>external<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
        console.log<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"external scroll"</span><span style="color: #b1951d;">)</span>
    <span style="color: #67b11d;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #67b11d;">{</span>
        console.log<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"internal scroll"</span><span style="color: #b1951d;">)</span>
    <span style="color: #67b11d;">}</span>
  <span style="color: #2d9574;">}</span>,
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
What does it mean?, well, <b>external</b> is an attempt
It can be changed any time:
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span> onScroll: <span style="color: #4f97d7; font-weight: bold;">null</span> <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

scrollManager.onScroll = <span style="color: #4f97d7;">()</span> =&gt; alert<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"hi"</span><span style="color: #4f97d7;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org568753a" class="outline-3">
<h3 id="org568753a">scroll</h3>
<div class="outline-text-3" id="text-org568753a">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">()</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">toPosition</span>
scrollManager.scroll<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
    value,
    duration?,
    easing?
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">or</span>
scrollManager.scroll<span style="color: #4f97d7;">(</span>value, duration?, easing?<span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">toElement</span>
scrollManager.scroll<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
    element,
    value?,
    duration?,
    easing?
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">or</span>
scrollManager.scroll<span style="color: #4f97d7;">(</span>element, value?, duration?, easing?<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org769732f" class="outline-4">
<h4 id="org769732f">to "position"</h4>
<div class="outline-text-4" id="text-org769732f">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">()</span>

scrollManager.scroll<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
  value,
  duration?,
  easing?,
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">or</span>
scrollManager.scroll<span style="color: #4f97d7;">(</span>value, duration?, easing?<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Calling <b>scroll</b> will do scroll to the position <b>value</b>: eg. <b>0</b> will do scroll
to the top of the page
</p>

<p>
<b>duration</b> is the duration of that scroll action. If not specified it will use the
one in <a href="#org24be2c5">constructor</a>.
</p>

<p>
<b>easing</b> is the ease animation of that scroll action. If not specified it will use the
one in <a href="#org3e5d67c">constructor</a>.
</p>
</div>
</div>
<div id="outline-container-orgc311b07" class="outline-4">
<h4 id="orgc311b07">to "element"</h4>
<div class="outline-text-4" id="text-orgc311b07">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">()</span>

scrollManager.scroll<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
    element,
    value?,
    duration?,
    easing?,
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">or</span>
scrollManager.scroll<span style="color: #4f97d7;">(</span>element, value?, duration?, easing?<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Calling <b>scroll</b> will do scroll to the position of the element <b>element</b>, and
will center it at <b>value</b>, 0 by default. ie. the element will be at the top of
the screen
</p>

<p>
<b>duration</b> is the duration of that scroll action. If not specified it will use the
one in <a href="#org24be2c5">constructor</a>.
</p>

<p>
<b>easing</b> is the ease animation of that scroll action. If not specified it will use the
one in <a href="#org3e5d67c">constructor</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org135fca9" class="outline-3">
<h3 id="org135fca9">offset</h3>
<div class="outline-text-3" id="text-org135fca9">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">()</span>

scrollManager.offset<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span>
  value: <span style="color: #a45bad;">100</span>,
  duration: <span style="color: #a45bad;">1000</span>,
  easing: <span style="color: #2d9574;">"some"</span>,
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">or</span>
scrollManager.offset<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span>, <span style="color: #a45bad;">1000</span>, <span style="color: #2d9574;">"some"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
