index.org
*** stopAllAnimations
To stop all scroll animations:

#+BEGIN_SRC typescript
const scrollManager = new Scroll()
scrollManager.stopAllAnimations()
#+END_SRC
*** size
The size of the *Scroll* container
#+BEGIN_SRC typescript
(new Scroll()).size // size of the window
(new Scroll("#container")).size // size of the element #container
#+END_SRC
The orientation of the value returned depends on the direction specified in the [[horizontal][contructor]]
*** scrollSize
The total scroll you can do within the *Scroll* container
#+BEGIN_SRC typescript
(new Scroll()).scrollSize // scrollSize of the windows
(new Scroll("#container")).scrollSize // scrollSize of the element #container
#+END_SRC
It's related to *scrollWidth/scrollHeight* properties of /HTMLElements/.

The orientation of the value returned depends on the direction specified in the [[horizontal][contructor]]
*** scrollPosition
The current position of the scroll
#+BEGIN_SRC typescript
(new Scroll()).scrollPosition // scrollPosition of the windows
(new Scroll("#container")).scrollPosition // scrollPosition of the element #container
#+END_SRC

For example, if you
#+BEGIN_SRC typescript
(new Scroll()).scroll(100)
#+END_SRC
the *scrollPosition* will be 100


The orientation of the value returned depends on the direction specified in the [[horizontal][contructor]]
*** getRelativeElementPosition
The relative position of certain element
#+BEGIN_SRC typescript
(new Scroll()).getRelativeElementPosition("#some-element")
#+END_SRC
It relates to [[to "element"][scroll]] (to "element"), so for example, if you
#+BEGIN_SRC typescript
(new Scroll()).scroll("#some-element", 0.5)
#+END_SRC
the relative position will be *0.5*
* *Misc* 
Here I export some other useful functions.  

They're meant for scroll-utility internal use, but I export them just in case someone 
wouldn't want to create a *Scroll* instance to access some of it's element properties.
#+BEGIN_SRC typescript
  import { Misc } from "scroll-utility"

  const Misc = ScrollUtility.Scroll // from cdn
#+END_SRC
** getSize
   Returns the size (width/height) of the element that match *element* selector
   #+BEGIN_SRC typescript
    Misc.getSize(element: string, horizontal)

    Misc.getSize(window, true)
    Misc.getSize("#container") // horizontal: false by default
   #+END_SRC
** getSizeWithBorders 
   Returns the size (including borders) of the element that match *element* selector
   #+BEGIN_SRC typescript
    Misc.getSizeWithBorders(element: string, horizontal)

    Misc.getSizeWithBorders(window, true)
    Misc.getSizeWithBorders("#container") // horizontal: false by default
   #+END_SRC
** getScrollPosition
   Returns the position of the scroll (top/left)
   #+BEGIN_SRC typescript
    Misc.getScrollPosition(element: string, horizontal)

    Misc.getScrollPosition(window, true)
    Misc.getScrollPosition("#container") // horizontal: false by default
   #+END_SRC
** getScrollSize
   Returns equivalent of scrollWidth/scrollHeight of elements
   #+BEGIN_SRC typescript
    Misc.getScrollSize(element: string, horizontal)

    Misc.getScrollSize(window, true)
    Misc.getScrollSize("#container") // horizontal: false by default
   #+END_SRC
