index.html
<div id="outline-container-org8120b3c" class="outline-3">
<h3 id="org8120b3c">other</h3>
<div class="outline-text-3" id="text-org8120b3c">
</div>
<div id="outline-container-org40b031a" class="outline-4">
<h4 id="org40b031a">stopAllAnimations</h4>
<div class="outline-text-4" id="text-org40b031a">
<p>
To stop all scroll animations:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">scrollManager</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #4f97d7;">()</span>
scrollManager.stopAllAnimations<span style="color: #4f97d7;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org18004ec" class="outline-4">
<h4 id="org18004ec">size</h4>
<div class="outline-text-4" id="text-org18004ec">
<p>
The size of the <b>Scroll</b> container
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>.size <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">size of the window</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"#container"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>.size <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">size of the element #container</span>
</pre>
</div>
<p>
The orientation of the value returned depends on the direction specified in the <a href="#org9fe9537">contructor</a>
</p>
</div>
</div>
<div id="outline-container-orgaf5b18e" class="outline-4">
<h4 id="orgaf5b18e">scrollSize</h4>
<div class="outline-text-4" id="text-orgaf5b18e">
<p>
The total scroll you can do within the <b>Scroll</b> container
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>.scrollSize <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">scrollSize of the windows</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"#container"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>.scrollSize <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">scrollSize of the element #container</span>
</pre>
</div>
<p>
It's related to <b>scrollWidth/scrollHeight</b> properties of <i>HTMLElements</i>.
</p>

<p>
The orientation of the value returned depends on the direction specified in the <a href="#org9fe9537">contructor</a>
</p>
</div>
</div>
<div id="outline-container-org2fd2480" class="outline-4">
<h4 id="org2fd2480">scrollPosition</h4>
<div class="outline-text-4" id="text-org2fd2480">
<p>
The current position of the scroll
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>.scrollPosition <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">scrollPosition of the windows</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"#container"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>.scrollPosition <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">scrollPosition of the element #container</span>
</pre>
</div>

<p>
For example, if you
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>.scroll<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
the <b>scrollPosition</b> will be 100
</p>


<p>
The orientation of the value returned depends on the direction specified in the <a href="#org9fe9537">contructor</a>
</p>
</div>
</div>
<div id="outline-container-orgb3594a9" class="outline-4">
<h4 id="orgb3594a9">getRelativeElementPosition</h4>
<div class="outline-text-4" id="text-orgb3594a9">
<p>
The relative position of certain element
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>.getRelativeElementPosition<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"#some-element"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
It relates to <a href="#orgc311b07">scroll</a> (to "element"), so for example, if you
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scroll</span><span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>.scroll<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"#some-element"</span>, <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
the relative position will be <b>0.5</b>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org3ec3dd9" class="outline-2">
<h2 id="org3ec3dd9"><b>Misc</b></h2>
<div class="outline-text-2" id="text-org3ec3dd9">
<p>
Here I export some other useful functions.  
</p>

<p>
They're meant for scroll-utility internal use, but I export them just in case someone 
wouldn't want to create a <b>Scroll</b> instance to access some of it's element properties.
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">{</span> Misc <span style="color: #4f97d7;">}</span> <span style="color: #4f97d7; font-weight: bold;">from</span> <span style="color: #2d9574;">"scroll-utility"</span>

<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">Misc</span> = ScrollUtility.Scroll <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">from cdn</span>
</pre>
</div>
</div>
<div id="outline-container-orgfe82371" class="outline-3">
<h3 id="orgfe82371">getSize</h3>
<div class="outline-text-3" id="text-orgfe82371">
<p>
Returns the size (width/height) of the element that match <b>element</b> selector
</p>
<div class="org-src-container">
<pre class="src src-typescript">Misc.getSize<span style="color: #4f97d7;">(</span>element: <span style="color: #4f97d7; font-weight: bold;">string</span>, horizontal<span style="color: #4f97d7;">)</span>

Misc.getSize<span style="color: #4f97d7;">(</span>window, <span style="color: #4f97d7; font-weight: bold;">true</span><span style="color: #4f97d7;">)</span>
Misc.getSize<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"#container"</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">horizontal: false by default</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2566678" class="outline-3">
<h3 id="org2566678">getSizeWithBorders</h3>
<div class="outline-text-3" id="text-org2566678">
<p>
Returns the size (including borders) of the element that match <b>element</b> selector
</p>
<div class="org-src-container">
<pre class="src src-typescript">Misc.getSizeWithBorders<span style="color: #4f97d7;">(</span>element: <span style="color: #4f97d7; font-weight: bold;">string</span>, horizontal<span style="color: #4f97d7;">)</span>

Misc.getSizeWithBorders<span style="color: #4f97d7;">(</span>window, <span style="color: #4f97d7; font-weight: bold;">true</span><span style="color: #4f97d7;">)</span>
Misc.getSizeWithBorders<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"#container"</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">horizontal: false by default</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org53fb797" class="outline-3">
<h3 id="org53fb797">getScrollPosition</h3>
<div class="outline-text-3" id="text-org53fb797">
<p>
Returns the position of the scroll (top/left)
</p>
<div class="org-src-container">
<pre class="src src-typescript">Misc.getScrollPosition<span style="color: #4f97d7;">(</span>element: <span style="color: #4f97d7; font-weight: bold;">string</span>, horizontal<span style="color: #4f97d7;">)</span>

Misc.getScrollPosition<span style="color: #4f97d7;">(</span>window, <span style="color: #4f97d7; font-weight: bold;">true</span><span style="color: #4f97d7;">)</span>
Misc.getScrollPosition<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"#container"</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">horizontal: false by default</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeae1cd9" class="outline-3">
<h3 id="orgeae1cd9">getScrollSize</h3>
<div class="outline-text-3" id="text-orgeae1cd9">
<p>
Returns equivalent of scrollWidth/scrollHeight of elements
</p>
<div class="org-src-container">
<pre class="src src-typescript">Misc.getScrollSize<span style="color: #4f97d7;">(</span>element: <span style="color: #4f97d7; font-weight: bold;">string</span>, horizontal<span style="color: #4f97d7;">)</span>

Misc.getScrollSize<span style="color: #4f97d7;">(</span>window, <span style="color: #4f97d7; font-weight: bold;">true</span><span style="color: #4f97d7;">)</span>
Misc.getScrollSize<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"#container"</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">horizontal: false by default</span>
</pre>
</div>
</div>
</div>
